-- =====================================================================
-- БАЗОВЫЕ НАСТРОЙКИ NEOVIM
-- =====================================================================

-- Установка алиасов для конфига
local opt = vim.opt
local g = vim.g

-- ---------------------------------------------------------------------
-- Общие параметры
-- ---------------------------------------------------------------------

-- Преобразование русских букв в латинские для горячих клавиш
vim.opt.langmap = "фa,иb,сc,вd,уe,аf,пg,рh,шi,оj,лk,дl,ьm,тn,щo,зp,йq,кr,ыs,еt,гu,мv,цw,чx,нy,яz"

-- ---------------------------------------------------------------------
-- Интерфейс
-- ---------------------------------------------------------------------

opt.number = true                   -- показывать номера строк
opt.relativenumber = true           -- относительные номера строк
